#include "header/types.h"

void grinNPC() // 상점
{
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡿⠟⠟⠿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⢍⠢⡨⡨⣈⢢⢈⠪⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠣⡑⡄⣗⡵⣫⢮⡳⡕⡕⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢟⢋⢋⢋⠛⠿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡢⡢⣻⣪⢯⡳⣫⢝⢮⡺⣪⢞⣞⢮⢯⡻⣽⡻⡿⣿⢣⢣⢢⣢⡢⣅⠑⠌⢝⣿⣿⣿⣿⣿\n";
    cout << "⡿⣿⣿⢿⣿⣿⣻⣿⣿⣻⣿⣷⣕⢕⡕⣇⠯⠪⠣⠣⠩⠪⡡⡑⠍⠕⢝⢚⠮⡻⡮⣳⢧⣻⣪⣞⢮⡣⡕⠄⢝⣿⣿⣟⣿\n";
    cout << "⣿⣿⣿⣿⣿⢿⣿⡿⣿⣿⣿⢟⢝⠜⢌⠢⠡⡡⠡⠡⠡⡑⡐⠌⢌⢊⠢⠡⡑⢌⠪⡑⠯⣺⣺⡪⣗⡯⡪⡈⠢⣿⣿⣿⣿\n";
    cout << "⣻⣿⣿⣯⣿⣿⣿⣿⣿⣿⢫⠪⠢⡑⡄⡗⣝⢮⢻⢜⡐⡐⠌⢌⢂⠢⠡⡑⢌⠢⡑⢌⠪⠢⡳⣝⢾⡸⡸⣸⣼⣿⣿⣟⣿\n";
    cout << "⣿⣿⡿⣿⣿⣿⢿⣿⣽⢇⠇⢅⢑⢜⢜⢜⢜⢜⢕⢇⠇⠌⢌⢂⠢⠡⡑⢌⠢⡑⢌⢦⣣⢵⡨⠪⡳⣳⣿⣽⣿⣿⣿⣿⣿\n";
    cout << "⣿⡿⣿⣿⣿⣻⣿⣿⡳⠡⡑⡐⡸⡘⣐⡐⡄⢅⢣⢳⠡⡑⡐⠄⢅⠑⢌⠢⡑⢌⢧⢳⢕⢯⢞⡕⢌⢪⢿⣿⣿⣟⣿⣾⣿\n";
    cout << "⣟⣿⣿⣿⣿⣿⣿⡗⡍⡂⡂⠢⡱⡸⡰⡸⡨⡣⡂⢇⢑⠐⠌⢌⠢⡑⢄⠑⠌⢜⢜⠜⠕⢝⢵⣻⢐⢕⢝⣿⣽⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣽⣿⣿⢪⢂⠢⡈⡂⢏⢎⢎⢎⢎⢎⢊⢂⠢⠡⡑⢄⠑⢌⠢⠡⠡⠱⢡⢱⢱⢥⡑⢵⢑⢐⢕⣿⣿⣿⡿⣿⣽\n";
    cout << "⣿⣿⣻⣽⣿⣿⣗⢕⢅⢑⠐⠌⢌⢘⢘⠘⢌⢂⢂⠢⡡⡱⡨⣢⡑⡄⠅⠅⢅⢑⢕⢕⢕⢕⢕⡱⡑⡐⢕⣽⣯⣿⣿⣿⣿\n";
    cout << "⣻⣿⣿⣿⣿⣿⣗⡕⡕⡄⢅⢑⢐⠐⢄⢑⢐⢐⢔⢵⢹⢪⢫⢺⢺⡪⡧⣑⠐⢄⠱⡱⡱⡱⡱⡑⡐⢌⢪⢾⣿⣿⣿⢿⣿\n";
    cout << "⣿⣿⡿⣿⣻⣽⣿⡮⣪⢪⢪⢢⢢⢱⢰⢰⢱⢱⢱⢑⢑⢐⠐⢄⠑⢕⢝⢧⡣⡢⡑⠌⢌⢊⢂⢂⢊⠢⡱⣿⣿⣿⣿⣿⣿\n";
    cout << "⣯⣿⣿⣿⣿⣿⣿⣿⣗⣕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⠐⢄⠑⢄⢑⠐⢕⢝⢮⢲⢨⢈⢂⢂⢂⢂⢢⢱⢝⣿⣿⣿⣯⣿⣿\n";
    cout << "⢿⣿⣿⢿⣿⣿⢿⣿⣿⣷⣯⣎⢎⡎⡎⡎⡎⡎⡎⡎⡎⡢⡑⡐⢄⢕⢕⢕⢕⢕⢕⢕⢆⢆⢆⢎⢎⢎⣿⣿⣿⣷⣿⣿⣿\n";
    cout << "⣿⣿⢿⣿⣿⢿⣿⣿⣻⣿⣟⡿⣟⢞⣞⣜⡮⡺⡸⡜⣜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢬⣿⣿⣿⣿⣿⣻⣿⣿\n";
    cout << "⣽⣿⣿⣿⣿⣿⣿⡿⡿⡳⡣⡏⣎⢞⢮⢳⣝⣎⢪⠪⡪⡪⡣⣓⡵⣕⣕⢕⣕⢕⢕⢕⢕⢕⠑⢄⢑⢘⣿⣿⣯⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⢿⢏⠫⡑⢜⢜⢌⢏⢞⢼⢱⢹⢸⢪⢾⢵⡳⡵⣮⢻⢽⡽⣇⢯⢺⢸⢽⡜⡜⡜⢔⢑⢐⣰⣴⣿⣿⣿⣿⣿⣿⣽\n";
    cout << "=================================================================\n";
}

void psychoNPC() // 상점
{
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠫⠡⠡⠡⡑⡙⡛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⡿⡛⠍⠍⠌⠍⢝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢱⠡⣕⢵⢕⡖⣔⡐⡐⢝⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⢋⠢⢨⢨⢜⣜⢬⢢⢪⢿⢿⡻⣻⡫⡯⣫⢯⢯⣫⢮⡣⡯⡳⣯⡺⣕⡗⡌⡂⣺⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣽⣿⣯⣿⣿⣯⢇⠢⢡⡳⡽⣕⣗⢝⢎⢮⢳⢕⡝⡮⡺⡝⡮⡫⡳⡳⡽⣝⢽⣝⢮⣞⢵⢝⢜⢜⣼⣿⣿⣿⣽⣿⣯⣿⣿\n";
    cout << "⣿⣿⣿⣿⣟⣿⡢⡡⡱⡯⣻⢪⡪⡎⡧⡫⡊⡣⠡⠡⡑⡐⡐⠌⢌⢂⢊⠢⡑⢕⢝⠮⡯⣳⢵⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟\n";
    cout << "⣿⣿⣷⣿⣿⣿⣿⣼⡸⡹⡸⡸⡸⡈⡂⡂⠢⠨⠨⡈⡂⡂⡪⠨⡂⡢⠡⡑⢌⣂⡢⡑⢌⢕⢯⡻⣿⣿⣿⣿⣾⣿⣷⣿⣿\n";
    cout << "⣻⣷⣿⣿⣿⣿⣻⣿⣿⢹⠘⢌⢂⢂⣢⡨⠨⡈⡂⡂⡂⠢⡈⡂⠢⠨⠨⣼⡿⡛⡛⠷⣇⠢⡑⢝⢞⣿⣿⣻⣿⣿⣟⣿⣿\n";
    cout << "⣿⣿⣿⣿⣯⣿⣿⣿⢕⢕⢑⢐⡴⡛⡓⢟⣧⡂⡂⠢⡈⡂⠢⠨⠨⠨⠨⣿⢑⠐⠌⠌⢝⣷⡨⡢⡙⣞⣿⣿⣿⣯⣿⣿⣿\n";
    cout << "⣻⣿⣿⣾⣿⣿⣿⡯⡪⡂⡂⣯⢑⠐⢌⠂⢯⡇⢌⢂⠢⠨⠨⠨⠨⠨⠨⣿⡆⠅⢅⢑⠐⢽⣇⠪⠨⡪⡾⣿⣻⣿⣿⣿⣿\n";
    cout << "⣿⣿⣟⣿⣯⣿⣿⢕⢕⢐⢸⣇⠢⡑⢄⢑⢸⡗⡐⠄⠅⠅⠅⠅⠅⠅⠅⠽⣿⡌⡂⠢⠡⣽⣷⠡⡑⢌⢞⣿⣿⣿⣿⣷⣿\n";
    cout << "⠪⡿⣿⣿⣿⣿⣿⢕⢔⢐⢸⣳⡐⢌⢂⢂⣯⡇⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠽⣿⣷⣷⣿⣿⡇⠕⢌⠢⡳⣽⣿⡿⣷⣿⣿\n";
    cout << "⡱⣑⢻⢿⣿⣯⣿⢕⢔⠐⠄⢯⢷⢦⣲⢽⡺⠨⠨⠨⠨⡨⡨⡬⡨⡌⡌⠌⢌⢊⢛⠞⢟⠪⠨⠨⠢⢡⡫⣞⣿⣿⣿⣿⣿\n";
    cout << "⢜⢜⢜⢜⢿⣿⢿⡣⡅⢅⠑⢌⠻⠽⠺⠝⠅⠅⢅⢕⢵⢱⢝⢮⢫⢞⡽⡵⣱⢐⠄⠅⠅⠅⠅⢅⢕⢵⢹⣺⣿⣿⣿⢿⣿\n";
    cout << "⢕⢕⢕⢕⢕⢽⢿⣟⡜⡄⡑⠄⠅⠅⠅⠅⠅⡅⡇⡇⡇⡣⠡⡑⡑⢕⢝⢮⡳⡳⣕⢕⢕⢕⢕⢕⢝⢜⣼⣿⣿⣿⣿⣿⣿\n";
    cout << "⢜⢜⡜⡼⣸⣸⡼⣻⣮⡪⡪⡌⡌⡌⡌⡌⡎⡎⡎⡮⡨⡈⡂⠢⡈⠢⡑⡕⡝⡎⡎⡎⡎⡎⡎⡎⣮⣾⣿⣿⣿⣷⣿⣿⣿\n";
    cout << "⣵⣷⣿⣿⣿⣿⣿⣯⣻⣾⣕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢔⢌⠢⡈⡂⡪⡪⡪⡪⡪⡪⡪⣪⢾⣾⣿⣿⣿⣿⣯⣿⣿⣿⣽\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⡿⡈⢞⣆⢍⢺⢸⢜⡜⣜⢜⢕⢵⢱⢕⢕⢕⢕⢕⢕⢕⢕⡕⣗⢿⣜⢮⡿⣝⡿⣿⣿⣾⣿⣿⣿⣽⣿\n";
    cout << "⣿⣿⣟⣿⣾⣿⣿⣷⣬⣢⡙⣗⣕⡕⡵⣣⢳⢭⢳⡹⣝⢵⢱⢳⢕⢧⢗⢷⢽⣞⣗⣟⣾⣗⡝⡎⡮⡳⣙⢛⢿⣷⣿⣿⣿\n";
    cout << "⣿⣽⣿⣿⣿⣿⣾⣿⣿⣿⣿⣷⣹⣣⡯⡪⡪⡪⡪⣺⢸⢸⢸⡪⣎⢮⢫⢯⡳⣗⣽⣺⢸⢺⣇⣇⢇⢕⠐⠅⠅⢽⣿⣿⣻\n";
    cout << "=================================================================\n";
}

void boredNPC() // 상점
{
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⢿⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠫⢉⡂⡆⡆⡆⡂⠢⡙⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠨⢨⢲⢕⣝⢮⢮⢪⢪⢪⢪⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n";
    cout << "⣿⣻⣿⡿⣿⣿⣿⣿⣿⡇⠅⠕⢕⢇⢗⢝⢪⢪⢪⢪⢚⢻⢛⠿⠿⠿⣿⣿⣿⣿⣿⡟⡕⡄⡑⡐⠄⢍⢛⢿⣿⣿⣿⡿⣟\n";
    cout << "⣿⣿⣿⣿⣿⣿⢿⣻⣿⣿⣮⠨⡢⡢⠱⢑⢑⠡⠡⠡⠡⠡⠡⢉⢊⢃⠒⠬⡩⣙⢛⢇⢇⢕⢕⢵⢝⡆⣆⠢⠹⣿⣿⢿⣿\n";
    cout << "⣿⣯⣷⣿⣿⢿⣿⣿⣿⡿⡫⠪⠨⠠⢁⢂⠂⠌⠌⠌⠌⠌⠌⡐⡐⡐⠨⢐⢐⠠⠑⠕⡕⡕⡝⢮⡳⣝⢮⢪⢂⢺⣿⣿⣿\n";
    cout << "⣾⣿⣿⢿⣿⣿⣿⣿⢏⢂⠂⠅⢅⢕⢢⢣⠣⡅⠅⠅⠅⠅⠅⡂⡂⡂⠅⡂⡂⠌⠌⡐⠨⠘⢜⢔⢝⢜⠎⢎⠢⣹⣿⣿⣻\n";
    cout << "⣿⢿⣾⣿⣿⣿⣻⠡⢁⠂⠌⡌⡎⡎⡎⡎⢮⣾⠨⠨⠨⠨⢐⢐⢐⠠⢁⢂⠂⠅⠅⡂⠅⠅⡂⡑⢕⢕⢕⣑⣵⣿⣿⣿⡿\n";
    cout << "⣿⣿⣿⡿⣿⣿⠣⢁⠂⠌⢄⣧⡇⢕⢌⠪⣾⡟⠨⠨⠨⠨⢐⢐⢐⠨⢐⢐⠨⣨⢪⢪⢣⢣⢂⠂⠌⢎⢾⣿⣿⣿⣿⡿⣿\n";
    cout << "⡿⣯⣿⣿⣿⠣⡑⡐⠨⠨⠈⣿⣧⣕⣵⣽⡿⠡⠡⠡⠡⢁⢂⢂⠂⠌⡐⡐⣨⣿⠣⡣⡣⡣⡣⠨⠨⠈⡎⣿⣿⣿⡿⣿⣿\n";
    cout << "⣿⣿⣿⢿⡇⢕⢐⠠⠡⠡⠡⢈⢛⢛⢛⠩⠠⠡⡡⡡⣁⢂⢂⠂⠌⡐⡐⡐⣸⣿⡑⢕⢕⢕⢕⠅⠅⠅⢸⢸⣿⣿⣿⣿⣟\n";
    cout << "⣿⣿⣾⣿⡇⢕⢐⠌⠌⠌⠌⡐⡐⡐⡐⡌⡎⢎⠎⠎⠎⠎⢎⢎⢆⢆⢂⢂⠘⣿⣮⣢⣱⣽⡷⠡⠡⠡⢸⢐⣿⣿⣿⣾⣿\n";
    cout << "⣽⣾⣿⣿⡇⢕⢐⠅⠕⠅⠕⢔⢌⠪⠪⠪⠪⠢⠡⠡⠡⢁⢂⠢⡑⡕⡕⡔⡐⡈⡛⠿⠟⠫⠨⠨⠨⠨⡸⡐⣿⣿⣿⣽⣿\n";
    cout << "⢿⣿⣟⣿⣿⡔⠄⠅⠅⠅⠅⠅⠅⢕⢑⠅⠅⠅⠅⠅⠅⡂⡂⡂⡂⡪⡪⡪⡢⡂⡂⠅⠅⠅⠅⠅⠅⢅⢇⢣⣿⣿⣿⣻⣿\n";
    cout << "⣿⡿⣿⡿⣿⣿⣌⠌⠌⠌⠌⠌⢌⢂⠢⠡⠡⠡⠡⠡⢁⢂⢂⢂⢂⠪⡪⡪⡪⡪⡢⡡⡡⠡⠡⠡⡡⡱⡑⢵⣿⣿⣿⢿⣿\n";
    cout << "⣷⣿⣿⣿⣿⣿⣿⣮⣌⡌⠌⠌⡂⠢⠡⠡⠡⠡⠡⢁⢂⢂⢂⠢⡑⢕⢌⠪⡪⡪⡪⡪⡪⡪⡱⡑⢕⢌⢪⣿⣿⣿⡿⣿⣿\n";
    cout << "⣿⣿⣻⣿⡟⡛⠿⢿⣿⣿⣷⣥⣂⠅⠅⠅⠅⠅⠅⡂⡂⡂⠢⡑⢌⢂⠢⡑⡐⠌⢌⢌⠪⡨⡊⡊⡢⢡⣿⣿⣿⣟⣿⣿⣷\n";
    cout << "⣿⣟⣿⣿⠁⡂⠅⡂⡢⡩⣙⢛⠻⠿⡮⣬⠨⠨⢐⢐⢐⠠⢁⢂⢂⢂⢑⠐⠌⢌⢂⠢⡑⡐⣐⣰⣼⣿⣿⣯⣷⣿⣿⣿⣯\n";
    cout << "⣿⢿⣿⣿⣄⡂⠅⡂⠪⡪⡪⡪⡪⡣⡪⡢⡹⡸⡸⡸⡰⡑⡆⡖⡔⡖⡶⡾⣾⣶⣶⣶⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⣿\n";
    cout << "⣿⣿⢿⣻⣿⣿⣷⣮⣂⣢⢨⢸⡸⣜⣮⣺⢜⡮⣪⢪⢪⢪⢪⢪⠪⡪⡪⡪⡪⡍⡛⢿⣿⣿⣿⣿⣿⣿⣯⣿⣯⣿⣾⣿⣟\n";
    cout << "=================================================================\n";
}

void sosoSmithNPC()
{
    cout << "⣿⠋⠁⠀⢀⠀⡀⢀⠀⠀⢀⣀⢄⣄⢤⢔⣖⢬⢌⣗⢽⢮⡳⣯⣺⡲⣖⡤⣄⣀⠀⠠⠐⠠⢀⢂⠢⢢⠱⡐⡵⣫⢞⡽⣿\n";
    cout << "⡇⠀⢀⠈⢀⠀⢀⡠⣔⢮⡳⣳⢳⡱⡽⣕⢷⢝⢗⡝⡕⡝⡝⠮⡺⡹⡳⡋⡛⢾⢽⡠⠀⠁⢐⠠⢑⠅⢕⢐⣝⢷⣝⢾⢝\n";
    cout << "⡇⠀⠀⠄⢀⢴⢵⢹⣪⡳⡝⡎⣞⢮⢡⠰⡑⢅⠣⢢⢑⠬⡘⡌⡢⡱⡨⢣⢒⢜⠽⣮⡪⣦⡀⠨⢐⢅⠣⡑⣜⣗⢵⢝⣕\n";
    cout << "⡇⠀⠂⢀⢗⣝⢦⢒⢕⢕⢕⢕⠕⡡⠢⡑⢌⠪⡘⢄⢅⢒⠔⡢⢒⠔⠜⡄⢥⠱⣱⢱⢹⡺⣖⡀⠂⢆⠣⡑⣕⣗⢕⢧⡣\n";
    cout << "⡇⠀⠀⢸⢰⢪⢪⢊⢎⢎⠎⡢⢑⠌⡪⠨⠢⡑⡌⡢⠢⡑⡌⢆⠕⡑⡕⢜⢰⢡⢱⢱⡓⣎⢻⢺⣎⠐⡅⢕⢕⢮⡳⡕⡧\n";
    cout << "⡇⠀⠀⢂⢇⢇⠕⡜⡜⢔⠡⠢⡑⢌⠢⡑⢅⠕⡰⠨⡊⡔⢌⠆⡕⡢⢢⠣⡨⣂⠣⢣⢳⡱⣣⢣⢟⡆⠨⡂⣏⢗⢵⢝⡮\n";
    cout << "⡇⠀⠀⡪⡪⡸⢨⢪⠪⠠⡡⡑⢌⠢⡑⢌⠢⡑⠜⢌⢆⠪⡂⢇⢪⠸⡰⡑⢕⠢⡹⡸⡜⣜⢎⢧⢻⣳⠀⡪⡪⡝⣎⢗⣟\n";
    cout << "⡇⠀⠀⡕⡜⠬⢀⢎⠌⢌⠢⠨⡂⢕⠨⠂⠑⠁⢁⠡⢢⢑⢅⠣⠡⠣⠪⡘⢌⢆⠌⠘⢜⢎⢗⣝⢜⢾⡀⠆⡇⣏⢎⢗⡝\n";
    cout << "⡇⠀⠀⡇⡕⡍⡊⡎⠨⡠⠑⠁⠈⠀⠀⠀⡀⡢⢡⢑⠱⡐⡅⢕⢍⢪⠪⡸⡨⡢⡣⡢⡀⠈⠑⠊⠗⡽⠄⢅⢣⢣⢳⢱⡹\n";
    cout << "⡇⠀⠀⡇⢎⢢⢃⢇⠅⠢⡡⠡⠀⡀⠔⡨⡂⡊⡔⠌⡌⢢⢊⠆⡕⢌⢎⢢⢱⠸⣐⢑⢌⢂⢀⠠⡢⣹⠁⡢⢊⢎⢎⢇⢗\n";
    cout << "⡇⠀⠐⡸⡘⡌⡎⣒⠨⠨⡠⢑⠐⡜⡜⠜⠘⠘⠸⡱⡌⡢⡡⡃⢎⢢⠱⡡⢢⢳⢜⠮⠺⠜⣶⡢⡱⡕⠨⡐⢅⢣⢳⢹⢸\n";
    cout << "⡇⠀⠀⡕⢜⢌⢪⢒⠨⢂⠊⢄⢱⢑⠅⠀⠀⠀⡀⢜⢜⠔⡌⢜⠌⢆⢣⠱⢱⢝⡎⢀⠀⢀⠈⣿⢪⠂⠕⡨⢂⢇⢇⢗⢕\n";
    cout << "⡇⠀⠀⡪⡊⡆⢕⠁⠕⡠⠡⠡⡂⢇⢇⢆⠤⡄⡆⡧⡣⠱⡨⡂⢇⢕⢢⠩⡪⡣⣏⢆⢄⡄⡴⡻⡔⠨⡈⡂⡊⢆⢇⢗⢕\n";
    cout << "⡇⠀⠀⡂⡕⢜⢐⢆⡃⠢⢑⠡⠂⠅⢅⠅⢌⠄⢅⠁⠌⠪⡐⠌⡆⡪⠢⡑⠌⢎⡊⣋⡣⡫⠭⡅⡅⡀⢂⠊⢌⠘⢌⢃⢃\n";
    cout << "⡇⠀⠀⢱⢘⠌⡆⢕⢜⠨⠐⡁⠪⠨⢂⠅⢕⠨⡂⢕⠡⡨⢘⠌⢢⢊⢎⠪⡘⡔⢜⠔⡅⡇⡇⡇⡝⡜⣆⠌⠐⠅⢕⢐⠅\n";
    cout << "⡇⠀⡈⠠⢱⠨⡢⠱⡨⡂⠅⡊⠌⢌⢂⠕⡐⡡⢊⠔⡑⢌⢂⢢⠠⡑⢔⢑⢄⠜⡔⢕⢱⠸⡰⡑⡕⢕⢜⢵⠈⠈⠂⠂⠅\n";
    cout << "⡇⠠⠐⢀⠨⢒⠸⡈⢎⢌⢂⠌⢌⢂⠢⠨⢂⠌⡂⡪⢐⠅⡪⡐⡱⢨⠢⡱⠰⡱⡘⡜⢔⢕⢱⢑⢕⢕⢕⢵⡁⠈⡀⢁⠀\n";
    cout << "⡇⠀⡐⠀⠀⢈⠪⡨⠢⡱⡐⠠⡁⡂⠅⠅⠕⡈⡂⡪⢐⢑⠔⢌⠌⡆⢕⠸⡨⠢⡑⡘⡌⡢⡑⠈⢢⢣⢪⢎⠢⡢⡀⠂⠄\n";
    cout << "⡇⠀⠀⡀⠈⠀⠈⢢⠑⡌⢆⠕⢐⠨⡈⡪⢈⢂⢊⠄⢕⢐⠅⠥⡑⢌⢆⠣⡊⡪⡘⡌⢆⢣⠱⡑⡌⡖⡕⠡⠢⡙⣜⢄⠐\n";
    cout << "⡇⠀⠀⡀⠠⠀⠀⠀⠑⡌⠢⡍⢔⢐⢐⢐⠡⢂⠅⠪⡐⢔⠡⡃⡊⢆⠢⠣⡑⡌⡪⡘⢌⢆⠇⠇⡋⠈⠄⠨⢈⠢⡸⡱⡥\n";
    cout << "⡇⠀⠀⡀⠀⠀⠀⠐⠀⠈⠨⠸⡰⡀⡂⡂⠅⡢⠡⡑⠌⡂⢕⠨⡨⢂⠣⡃⢕⠌⡢⡊⡆⠃⠀⠁⠄⠡⢈⠐⠠⠈⠔⡑⣝\n";
    cout << "⡇⠀⠀⠀⠠⠐⠀⠀⡀⠀⡀⠐⠈⡢⠡⠂⠅⢂⠅⠢⡑⠨⡂⠕⡨⠢⡑⢌⢆⢊⢆⠪⠀⢀⠐⠈⠔⢌⢂⠪⡘⠜⡌⡺⡸\n";
    cout << "⡇⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⡄⠆⡊⢌⢪⠨⡐⡨⢂⢊⠌⠔⡡⢊⠌⡌⡢⠢⡑⠀⠠⠀⢀⠀⠄⡑⢅⠥⡑⢌⠪⠢⡑⠭\n";
    cout << "⡇⠀⠀⠁⠀⢀⠀⠠⠀⠠⠐⠔⡈⢄⠪⡢⡁⠨⢄⢂⢂⢊⠌⢔⠐⢅⠢⡊⢜⠐⠈⠀⢀⠀⢀⠀⢀⠂⠐⢈⠀⠅⠃⡑⠑\n";
    cout << "⡇⠀⠀⠐⠈⠀⠀⠀⠀⠀⢀⢌⢪⠀⢇⢆⠅⠀⠈⢢⢑⢄⢀⠀⢁⢠⢒⢜⠜⠀⠀⠂⠀⢀⠀⠄⠀⠂⠡⠐⠀⠌⡀⠂⡁\n";
    cout << "=================================================================\n";
}

void angrySmithNPC()
{
    cout << "⣿⠛⠉⠉⠉⠉⢉⡉⠉⡉⣿⡿⢫⡻⡫⣫⢟⠏⡝⣽⣿⣿⣿⣿⡿⡿⢿⣟⣿⣿⣿⣿⣿⣿⣿⣝⣋⠉⠉⠉⠉⠉⠉⠻⣿\n";
    cout << "⠃⠀⠀⠀⠀⢀⣸⣿⣾⣻⣳⡼⣪⣾⡟⢕⠡⡪⣼⢿⣙⡪⣣⡲⣕⢝⢮⡺⡜⡮⡪⣎⢧⢫⡳⠿⣦⣑⣄⠀⠀⠀⠀⠀⢸\n";
    cout << "⠀⠀⠀⠀⠀⠟⠟⠙⢾⣿⣟⣿⣿⣻⣷⡵⣗⢯⢳⢕⢵⡹⡜⡮⣪⠳⠕⡃⡫⡊⡋⢎⠮⣳⢹⢝⢼⣙⢿⣷⠀⠀⠀⠀⢸\n";
    cout << "⠀⠂⠀⠀⢰⡄⠀⢀⣸⣿⣟⣿⣽⡿⡳⡝⡮⣪⢳⡹⣕⢵⢝⢎⡖⣝⢝⡜⡮⣪⢫⡺⡜⡦⡍⣗⡳⣕⢧⢝⢇⠀⠀⠂⢸\n";
    cout << "⢀⠀⠀⡀⢺⣷⣾⡿⡯⡫⣿⡿⡯⢮⡳⡝⡮⣪⢳⢕⢧⡳⡝⡮⢚⢌⡆⡦⣪⢢⢆⢦⡱⣉⠺⣜⢮⢎⣗⢽⢌⠂⠀⠀⢸\n";
    cout << "⠀⠀⠀⠀⢰⣿⣷⢏⠇⡕⣿⢯⢝⢵⡱⡝⡮⣪⡳⡝⡮⡺⡪⡮⣫⢣⠏⡞⣎⢗⣝⢵⢍⢎⢯⡪⡮⡳⣕⢗⡕⡆⠁⠀⢸\n";
    cout << "⠀⠁⠀⠠⠘⣿⣽⢸⢨⣾⡯⡳⡝⡖⡌⠈⠚⠜⠜⠎⠗⠝⠎⠞⠘⠀⣜⡚⠼⢱⠣⣓⢗⠄⠁⠃⠓⠝⡜⢵⠹⠂⠀⠄⢸\n";
    cout << "⠈⡀⠂⡀⠂⣿⡯⣺⣿⣿⢙⢮⣓⡩⢈⠐⠀⠈⠀⠁⠀⠁⢀⠀⠄⢪⡪⣊⠯⠲⡙⡜⡜⢈⠠⠐⠀⠀⠄⠀⠀⢈⠀⡀⢸\n";
    cout << "⠀⠄⠂⡀⠂⠍⣯⣿⣿⣽⢨⡳⡪⠊⠁⡀⠄⠁⠀⡁⠀⡁⡀⠄⠂⡁⠌⠊⠎⠇⡋⡐⡐⣐⣠⣂⡄⠂⠀⠐⠈⡀⢀⠀⢸\n";
    cout << "⡈⢐⠠⠀⠂⢡⢻⣿⣾⡯⢢⡳⡕⡧⡣⡀⠄⣤⣵⣾⡿⣶⣦⣌⢐⠠⠈⠌⡈⡐⢀⢂⣴⣿⡻⣟⢿⣿⣌⢆⢤⡈⢀⢈⢸\n";
    cout << "⡐⢀⢐⢀⠡⠐⣽⣻⣾⣿⠨⡎⣗⡝⡮⡣⣽⣿⠋⠌⡐⠨⡙⣿⣧⠠⢁⢂⠐⡀⡂⣾⣻⢃⢂⠂⠅⠝⣿⣎⢧⠁⡂⡂⢸\n";
    cout << "⣦⣲⢶⢶⣺⣵⢻⡼⣿⣻⢀⢯⡪⡮⣫⡺⣿⡧⠡⠁⠄⠡⢐⢸⣿⠐⡀⢂⠐⡀⢂⢻⣿⡐⡐⠨⢐⢡⣿⢺⠂⡂⡐⠐⢸\n";
    cout << "⣷⣻⣟⣯⣷⣻⠹⣿⢑⠽⡇⢰⢳⡹⣜⢎⢿⣿⣬⡨⠨⣨⢴⣿⠏⡐⢐⢀⠂⡂⢂⠘⠯⣿⡦⡵⣐⡛⡣⠣⢂⠐⡀⠂⢸\n";
    cout << "⡧⡿⣞⣷⡻⡪⢱⢸⡕⡐⣧⢁⢳⡹⡜⡝⡬⢬⢱⢭⢩⠭⣛⢉⢐⠐⡀⣆⢎⢦⢢⢕⢽⡐⡮⡺⡲⣕⡝⣕⢄⠊⢄⢈⢸\n";
    cout << "⡾⣽⠗⢕⠌⡜⡐⡨⢻⡀⢿⡆⡊⡪⡮⡫⡮⡳⡳⣕⣝⢝⢼⢜⢲⠌⡜⡪⡝⢪⡳⣹⢑⢵⢝⢮⡳⡵⣹⢪⢮⠈⠔⡠⢸\n";
    cout << "⢟⢅⢣⠡⡃⡪⡐⡂⡻⡎⡌⢿⡄⢫⢎⢯⢎⢯⡺⣜⢼⡱⡳⡝⣎⢯⢸⡪⣎⢆⢅⠅⣪⢳⡹⣪⡺⡪⡮⡳⢕⢬⢨⠠⣼\n";
    cout << "⡱⢐⠅⢕⢌⠢⡊⡢⡂⢕⠨⠐⢌⠌⣗⢝⢮⢳⡹⣜⢮⢮⢳⢝⡎⣗⡕⡧⡳⣝⢵⡹⣌⣚⢜⡪⣪⡫⡪⣎⢧⢳⠁⢄⣿\n";
    cout << "⣬⡢⠣⡑⢔⢑⢌⢂⢪⢰⣦⢑⠔⡡⡘⢵⢝⢵⢝⢮⢺⡪⡳⣕⢽⢜⡎⡯⡺⣜⢕⢧⡳⡕⡧⡫⡮⣪⡫⢎⠮⡣⣧⢿⣽\n";
    cout << "⣷⣻⢷⣅⢣⢒⠔⠅⡂⢅⠟⡂⢕⢐⠌⠪⡱⢝⢮⢳⡣⡯⡺⣪⢳⢕⣝⢮⢳⢕⡝⡮⡺⠜⡪⠅⡓⢔⢐⢡⣢⢿⣽⣻⢾\n";
    cout << "⣗⣿⢽⡯⣷⣆⣣⣿⡎⣆⣷⢕⢁⠢⡐⢅⠢⡑⡙⢮⢺⡪⡫⣎⢗⣕⢧⢳⡹⢊⢌⢆⢮⢊⢆⢣⣱⡵⣞⣿⣺⣟⢞⡽⣿\n";
    cout << "⢺⡽⣯⣟⡷⣷⣻⣿⣷⣅⢏⠆⢕⠨⡢⠀⢕⠰⢈⠢⢑⢙⢎⢮⢣⡳⡕⡧⣣⢢⡺⡸⣐⡦⣗⣯⢷⡿⣽⣞⡷⢣⢱⡿⣽\n";
    cout << "⡽⣯⢷⡯⣿⡽⣾⣿⣾⡋⢆⠣⡣⣗⢌⢌⠂⠁⢐⢐⢀⠀⠀⠈⠑⢱⠹⡘⡊⣕⡵⣞⣷⣻⡽⣾⢯⣟⡷⣯⢇⠣⡽⣽⣻\n";
    cout << "⣿⣿⣽⣯⣷⣻⣽⣗⣯⣞⣷⣧⣝⣿⣎⣢⣅⣄⣔⣰⣐⣁⣅⣬⣼⣲⣵⣖⣿⣺⣽⣻⣞⣷⣻⣽⣯⣷⣻⣽⣪⣨⣿⣽⣿\n";
    cout << "=================================================================\n";
}

void buyEquip()
{
    while (1)
    {
        grinNPC();
        cout << "판도라: 초보자를 위한 장비들을 팔고 있어요!\n";
        cout << "1. 기본검    2. 기본스태프  3. 기본활    4. 기본창    5. 기본단검\n";
        cout << "6. 기본갑빠  7. 기본장화    8. 기본장갑  9. 기본망토  10. 기본마스크\n";
        cout << "q. 뒤로가기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            break;
        }
        else if (choice == "1" || choice == "2" || choice == "3" || choice == "4" || choice == "5" || choice == "6" || choice == "7" || choice == "8" || choice == "9" || choice == "10")
        {
            int num, price;

            num = stoi(choice)-1;
            if (stoi(choice) < 6)
            {
                price = 50;
            }
            else
            {
                price = 30;
            }
            while (1)
            {
                grinNPC();
                cout << "판도라: " << "inv->equipNameList[num]" << "을 구매하실 건가요?\n";
                cout << "inv->equipNameList[num]" << ": " << "inv->equipSpecList[num]" << ", " << "inv->equipTypeList[num]" << endl;
                cout << "가격: " << price << "원\n";
                cout << "보유한 골드: " << "inv->gold" << endl;
                cout << "1. 구매하기  q. 뒤로가기\n";
                cout << "=================================================================\n";

                cin >> choice;
                system("clear");

                if (choice == "q")
                {
                    break;
                }
                else if (choice == "1")
                {
                    // if (inv->gold > price)
                    // {
                        grinNPC();
                        cout << "구매해주셔서 감사합니다!\n";                    
                        cout << "inv->equipNameList[num]" << " 구매, " << price << "원 차감\n";                    
                        // inv->gold -= price;
                        sleep(2);
                        system("clear");
                        break;
                    // }
                    // else
                    // {
                    //     boredNPC();
                    //     cout << "앗! 보유하신 골드가 부족해요...다른 상품을 보시겠어요?\n";
                    //     sleep(2);
                    //     system("clear");
                    //     break;
                    // }
                    
                }
                else
                {
                    continue;
                }       
            }
        }
        else
        {
            continue;
        }
    }
}

void buyConsumable()
{
    while (1)
    {
        grinNPC();
        cout << "판도라: 말섬 상점산 특제 상품이에요!\n";
        cout << "1. 빨간물약  2. 마을이동주문서  q. 뒤로가기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            break;
        }
        else if (choice == "1" || choice == "2")
        {
            int num, price;
            if (choice == "1")
            {
                num = 0;
                price = 30;
            }
            else
            {
                num = 4;
                price = 100;
            }
            while (1)
            {
                grinNPC();
                cout << "판도라: " << "inv->consumableNameList[num]" << "을 구매하실 건가요?\n";
                cout << "inv->consumableNameList[num]" << ": " << "inv->consumableEXList[num]" << endl;
                cout << "가격: " << price << "원\n";
                cout << "보유한 골드: " << "inv->gold" << endl;
                cout << "1. 구매하기  q. 뒤로가기\n";
                cout << "=================================================================\n";

                cin >> choice;
                system("clear");

                if (choice == "q")
                {
                    break;
                }
                else if (choice == "1")
                {
                    // if (inv->gold > price)
                    // {
                            grinNPC();
                            cout << "구매해주셔서 감사합니다!\n";                    
                            cout << "inv->consumableNameList[num]" << " 구매, " << price << "원 차감\n";                    
                            // inv->gold -= price;
                            sleep(2);
                            system("clear");
                            break;
                    // }
                    // else
                    // {
                    //     boredNPC();
                    //     cout << "앗! 보유하신 골드가 부족해요...다른 상품을 보시겠어요?\n";
                    //     sleep(2);
                    //     system("clear");
                    //     break;
                    // }
                    
                }
                else
                {
                    continue;
                }       
            }
        }
        else
        {
            continue;
        }
    }
}

void shopNPC()
{
    srand((int)time(NULL));

    while(1)
    {
        grinNPC();
        cout << "판도라: 어서오세요! 24시간 내내 열려있는 말섬 상점입니다!\n";
        cout << "1. 구매하기  2. 판매하기  3. 농담하기  q. 나가기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            grinNPC();
            cout << "판도라: 감사합니다 용사님! 다음에 또 뵐게요!\n";
            cout << "=================================================================\n";
            sleep(2);
            system("clear");
            // closeInven();
            break;
        }
        else if (choice == "1")
        {
            while (1)
            {
                grinNPC();
                cout << "판도라: 뭘 구매하실 건가요?\n";
                cout << "1. 장비  2. 소모품  q. 뒤로가기\n";
                cout << "=================================================================\n";

                cin >> choice;
                system("clear");

                if (choice == "q")
                {
                    break;
                }
                else if (choice == "1")
                {
                    buyEquip();
                    continue;
                }
                else if (choice == "2")
                {
                    buyConsumable();
                    continue;
                }
                else
                {
                    continue;
                }   
            }
        }
        else if (choice == "2")
        {
            // TODO : 판매
            cout << "구현 예정\n";
        }
        else if (choice == "3")
        {
            int reactNum = rand() % 10;
            
            if (reactNum < 7)
            {
                grinNPC();
                cout << "판도라: 용사님은 농담도 잘하시네요!\n";
                sleep(2);
                system("clear");
                continue;
            }
            else if (reactNum < 9)
            {
                boredNPC();
                cout << "판도라: 하하하..재밌네요\n";
                sleep(2);
                system("clear");
                continue;
            }
            else
            {
                psychoNPC();
                cout << "나레이션: 판도라가 갑자기 무서운 표정으로 노려보더니 상점에서 내쫓았다..\n";
                sleep(2);
                system("clear");
                // closeInven();
                break;
            }
        }
        else
        {
            continue;
        }
    }
}

void smithNPC()
{
    while(1)
    {
        sosoSmithNPC();
        cout << "대장장이: 어서오게.\n";
        cout << "1. 구매하기  2. 농담하기  q. 나가기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            sosoSmithNPC();
            cout << "대장장이: 다음에 또 보자고.\n";
            cout << "=================================================================\n";
            sleep(2);
            system("clear");
            // closeInven();
            break;
        }
        else if (choice == "1")
        {
            while (1)
            {
                sosoSmithNPC();
                cout << "대장장이: 강화주문서를 사려고? 하나당 300원이야.\n";
                cout << "inv->consumableNameList[7]" << ", " << "inv->consumableEXList[7]" << endl;
                cout << "보유한 골드: " << "inv->gold" << endl;
                cout << "1. 구매하기  2. 직접 강화는 안 해주시나요?  q. 뒤로가기\n";
                cout << "=================================================================\n";

                cin >> choice;
                system("clear");

                if (choice == "q")
                {
                    break;
                }
                else if (choice == "1")
                {
                    // if (inv->gold > 300)
                    // {
                            sosoSmithNPC();
                            cout << "잘 사용하라고.\n";                    
                            cout << "inv->consumableNameList[7]" << " 구매, 300원 차감\n";                    
                            // inv->gold -= 300;
                            sleep(2);
                            system("clear");
                            continue;
                    // }
                    // else
                    // {
                    //     sosoSmithNPC();
                    //     cout << "자네, 돈이 부족한데?\n";
                    //     sleep(2);
                    //     system("clear");
                    //     break;
                    // }
                    
                }
                else if (choice == "2")
                {
                    angrySmithNPC();
                    cout << "대장장이: 이놈! 쓸데없는 소리 말고 저기 코쟁이한테 가라!\n";
                    sleep(1);
                    cout << "나레이션: 화난 대장장이가 당신을 대장간에서 쫓아냈습니다...\n";
                    sleep(2);
                    system("clear");
                    // closeInven();
                    return;
                }
                else
                {
                    continue;
                }   
            }
        }
        else if (choice == "2")
        {
            angrySmithNPC();
            cout << "나레이션: 분노한 대장장이가 당신을 쫓아냈습니다.....\n";
            sleep(2);
            system("clear");
            // closeInven();
            break;
        }
        else
        {
            continue;
        }
    }
}

void enhanceAct()
{
    while (1)
    {
        cout << "인첸트마법사: 강화 하시려구요..? 어떤 장비를 강화 하실 건가요?\n";
        cout << "1. 마스크   2. 갑옷   3. 신발   4. 장갑   5. 망토   6. 무기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            cout << "인첸트마법사: 또 오세요...\n";
            break;
        }
        else if (choice == "6")
        {
            while (1)
            {
                cout << "인첸트마법사: 강화 비용은 10000골드입니다...\n";
                cout << "보유한 골드: " << "inv->gold" << endl;
                cout << "=================================================================\n";
                cout << "나레이션: 강화 레벨이 -10 ~ +10 됩니다.";
                cout << "<경고!> 강화 수치가 0보다 낮아지면 장비가 파괴됩니다.\n";
                cout << "=================================================================\n";
                cout << "정말 강화를 진행하시겠습니까?\n";
                cout << "1. 예   2. 아니오\n";
                cout << "=================================================================\n";

                string choice;
                cin >> choice;
                system("clear");

                int prob = rand() % 21 -10;

                if (choice == "1")
                {
                    // if ("inv->gold" < 10000)
                    // {
                    //     cout << "인첸트마법사: 골드가 모자라시네요..\n";
                    //     sleep(1);
                    //     break;
                    // }
                    // cout << "강화중";
                    // for (int i = 0; i < 10; i++)
                    // {
                    //     cout << ".";
                    //     usleep(300000);    
                    // }
                    system("clear");
                    cout << "=================================================================\n";
                    cout << "                           강화 완료!\n";
                    cout << "=================================================================\n";
                    sleep(3);
                    // if ((user->nowWeaponId-1) % 10 + prob < 0) 
                    // {
                    //     cout << prob << " 당첨!\n";
                    //     sleep(1);
                    //     cout << "장비 레벨이 0 아래로 내려가서 장비가 파괴됩니다...\n";
                    //     sleep(2);
                    //     system("clear");
                    //     user->nowWeaponId = 0;
                    // }
                    // else if ((user->nowWeaponId-1) % 10 + prob > 10)
                    // {
                    //     cout << prob << " 당첨!\n";
                    //     sleep(1);
                    //     cout << "축하합니다! 최대 강화에 도달하였습니다.\n";
                    //     sleep(2);
                    //     system("clear");
                    //     if (user->nowWeaponId <= 100)
                    //     {
                    //         user->nowWeaponId = user->nowWeaponId * 10 + 99;
                    //     }
                    //     else
                    //     {   
                    //         user->nowWeaponId = user->nowWeaponId - (user->nowWeaponId % 10) + 10; 
                    //     }
                    // }
                    
                }
                else if (choice == "2")
                {
                    break;
                }
                else
                {
                    continue;
                }
            }
        }
        else if (choice == "1" || choice == "2" || choice == "3" || choice == "4" || choice == "5")
        {
            while (1)
            {
                cout << "인첸트마법사: 강화 비용은 10000골드입니다...\n";
                cout << "보유한 골드: " << "inv->gold" << endl;
                cout << "=================================================================\n";
                cout << "나레이션: 강화 레벨이 -10 ~ +10 됩니다.";
                cout << "<경고!> 강화 수치가 0보다 낮아지면 장비가 파괴됩니다.\n";
                cout << "=================================================================\n";
                cout << "정말 강화를 진행하시겠습니까?\n";
                cout << "1. 예   2. 아니오\n";
                cout << "=================================================================\n";

                string choice;
                cin >> choice;
                system("clear");

                int prob = rand() % 21 -10;

                if (choice == "1")
                {
                    // if ("inv->gold" < 10000)
                    // {
                    //     cout << "인첸트마법사: 골드가 모자라시네요..\n";
                    //     sleep(1);
                    //     break;
                    // }
                    // cout << "강화중";
                    // for (int i = 0; i < 10; i++)
                    // {
                    //     cout << ".";
                    //     usleep(300000);    
                    // }
                    system("clear");
                    cout << "=================================================================\n";
                    cout << "                           강화 완료!\n";
                    cout << "=================================================================\n";
                    sleep(3);
                    // if ()
                    // {
                        
                    // }
                    

                }
                else if (choice == "2")
                {
                    break;
                }
                else
                {
                    continue;
                }
            }
        }
        else
        {
            continue;
        }   
    }
    
}

void enhanceWizzard()
{
    while(1)
    {
        sosoSmithNPC();
        cout << "인첸트마법사: 어서오세요..\n";
        cout << "1. 강화하기  q. 나가기\n";
        cout << "=================================================================\n";

        string choice;
        cin >> choice;
        system("clear");

        if (choice == "q")
        {
            sosoSmithNPC();
            cout << "인첸트마법사: 또 오세요..\n";
            cout << "=================================================================\n";
            sleep(2);
            system("clear");
            // closeInven();
            break;
        }
        else if (choice == "1")
        {
            enhanceAct();
            continue;
        }
        else
        {
            continue;
        }
    }
    
}


// int main()
// {
//     // 상점 (7)
//     // 37, 15
//     shopNPC();

//     // 대장간 (9)
//     // 39, 40
//     enhanceNPC();
// }